# Rebar Shape Terminations Data Hook Angle At Start Property

Source: https://www.revitapidocs.com/2026/de6852cb-a71a-1e57-6b81-4e088e42f8fa.htm

---

| Rebar Shape Terminations Data Hook Angle At Start Property |
| --- |

Identifies the hook angle (in degrees) at the start of the rebar shape.
 The angle must be at least 0 and no more than 180\. In case it is 0 it will be considered that the shape doesn't have a hook. Common values are 0, 90, 135, and 180\.
 Setting this property to a value strictly greater than 0 and less or almost equal with 180 will set the HasCrankAtStart to false and EndTreatmentTypeIdAtStart to ElementId.InvalidElementId.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public int HookAngleAtStart { get; set; }
```

```
Public Property HookAngleAtStart As Integer
	Get
	Set
```

```
public:
property int HookAngleAtStart {
	int get ();
	void set (int value);
}
```

```
member HookAngleAtStart : int with get, set
```

#### Property Value

Int32 Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: hookAngleAtStart must be at least 0 and no more than 180\. |

See Also

#### Reference

RebarShapeTerminationsData Class Autodesk.Revit.DB.Structure Namespace